<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,3,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/transform/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/transform/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Reshape_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/transform/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Shape_4_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/transform/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/transform/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Broadcast_86" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/transform/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/transform/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/transform/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/transform/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="56" size="16" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_8_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/transform/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/transform/Resize" type="Interpolate" version="opset11">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Resize_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_9687" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="72" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/transform/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_8888" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="104" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_8946" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_8948" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="116" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/model/teacher/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/teacher/Div_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model.ae.encoder.enconv1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 4, 4" offset="128" size="6144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv1.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model/ae/encoder/enconv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_284" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="6272" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model/ae/encoder/enconv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv1/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model/ae/encoder/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/encoder/Relu_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model.ae.encoder.enconv2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 4, 4" offset="6400" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv2.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/model/ae/encoder/enconv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_301" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="71936" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model/ae/encoder/enconv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv2/Conv_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/model/ae/encoder/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/encoder/Relu_1_output_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model.ae.encoder.enconv3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 4, 4" offset="72064" size="131072" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv3.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/model/ae/encoder/enconv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_318" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="203136" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model/ae/encoder/enconv3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv3/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model/ae/encoder/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/encoder/Relu_2_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.ae.encoder.enconv4.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 4, 4" offset="203392" size="262144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv4.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model/ae/encoder/enconv4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_335" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="465536" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model/ae/encoder/enconv4/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv4/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/model/ae/encoder/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/encoder/Relu_3_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model.ae.encoder.enconv5.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 4, 4" offset="465792" size="262144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv5.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model/ae/encoder/enconv5/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_352" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="727936" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model/ae/encoder/enconv5/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv5/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model/ae/encoder/Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/encoder/Relu_4_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model.ae.encoder.enconv6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 8, 8" offset="728192" size="1048576" />
			<output>
				<port id="0" precision="FP32" names="model.ae.encoder.enconv6.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model/ae/encoder/enconv6/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_369" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="1776768" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model/ae/encoder/enconv6/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/encoder/enconv6/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model/ae/decoder/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/ae/decoder/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model/ae/decoder/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/model/ae/decoder/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Broadcast_396" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model/ae/decoder/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model/ae/decoder/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/model/ae/decoder/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/Shape_1_output_0,/model/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/Constant_output_0" />
			</output>
		</layer>
		<layer id="55" name="Constant_114" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="/model/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/Gather_output_0" />
			</output>
		</layer>
		<layer id="57" name="/model/ae/decoder/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777024" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_output_0" />
			</output>
		</layer>
		<layer id="58" name="/model/ae/decoder/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_1_output_0,/model/ae/decoder/Cast_output_0,/model/ae/decoder/Div_output_0" />
			</output>
		</layer>
		<layer id="59" name="Constant_8892" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777032" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="60" name="/model/ae/decoder/Sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Sub_output_0" />
			</output>
		</layer>
		<layer id="61" name="Constant_212" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_166">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/model/ae/decoder/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777040" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="64" name="Constant_118" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="65" name="/model/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/model/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="66" name="/model/ae/decoder/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777024" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="67" name="/model/ae/decoder/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_2_output_0,/model/ae/decoder/Cast_3_output_0,/model/ae/decoder/Div_1_output_0" />
			</output>
		</layer>
		<layer id="68" name="Constant_8896" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777032" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="69" name="/model/ae/decoder/Sub_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="70" name="Constant_214" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_168">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model/ae/decoder/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/model/ae/decoder/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_4_output_0,/model/ae/decoder/Concat_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model/ae/decoder/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model/ae/decoder/Resize" type="Interpolate" version="opset11">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/Resize_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model.ae.decoder.deconv1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 4, 4" offset="1777048" size="262144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.decoder.deconv1.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model/ae/decoder/deconv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_522" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2039192" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model/ae/decoder/deconv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/deconv1/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model/ae/decoder/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/decoder/Relu_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model/ae/decoder/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/ae/decoder/Shape_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/model/ae/decoder/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model/ae/decoder/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Broadcast_546" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model/ae/decoder/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/model/ae/decoder/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/model/ae/decoder/Slice_1_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_9681" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_9682" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/Unsqueeze_2_output_0,/model/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_9671" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2039448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model/ae/decoder/Div_2" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_5_output_0,/model/ae/decoder/Cast_6_output_0,/model/ae/decoder/Div_2_output_0,/model/ae/decoder/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_9684" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_9685" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/Unsqueeze_1_output_0,/model/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_9674" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2039448" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model/ae/decoder/Div_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_7_output_0,/model/ae/decoder/Cast_8_output_0,/model/ae/decoder/Div_3_output_0,/model/ae/decoder/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model/ae/decoder/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_9_output_0,/model/ae/decoder/Concat_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model/ae/decoder/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Concat_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/model/ae/decoder/Resize_1" type="Interpolate" version="opset11">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/Resize_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model.ae.decoder.deconv2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 4, 4" offset="2039456" size="262144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.decoder.deconv2.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model/ae/decoder/deconv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Reshape_672" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2301600" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model/ae/decoder/deconv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/deconv2/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model/ae/decoder/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model/ae/decoder/Relu_1_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model/ae/decoder/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/model/ae/decoder/Shape_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model/ae/decoder/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model/ae/decoder/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Broadcast_700" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model/ae/decoder/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model/ae/decoder/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/model/ae/decoder/Slice_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model/ae/decoder/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2301856" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="109" name="/model/ae/decoder/Div_4" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_10_output_0,/model/ae/decoder/Cast_11_output_0,/model/ae/decoder/Div_4_output_0" />
			</output>
		</layer>
		<layer id="110" name="Constant_8900" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777032" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="111" name="/model/ae/decoder/Sub_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="112" name="Constant_262" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_220">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/model/ae/decoder/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/model/ae/decoder/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2301856" size="8" />
			<output>
				<port id="0" precision="I64" names="/model/ae/decoder/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="115" name="/model/ae/decoder/Div_5" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_12_output_0,/model/ae/decoder/Cast_13_output_0,/model/ae/decoder/Div_5_output_0" />
			</output>
		</layer>
		<layer id="116" name="Constant_8904" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1777032" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="117" name="/model/ae/decoder/Sub_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="118" name="Constant_264" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_222">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/model/ae/decoder/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/model/ae/decoder/Concat_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Cast_14_output_0,/model/ae/decoder/Concat_4_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/model/ae/decoder/Concat_5" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/model/ae/decoder/Concat_5_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/model/ae/decoder/Resize_2" type="Interpolate" version="opset11">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/Resize_2_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="model.ae.decoder.deconv3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 4, 4" offset="2301864" size="262144" />
			<output>
				<port id="0" precision="FP32" names="model.ae.decoder.deconv3.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/model/ae/decoder/deconv3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Reshape_826" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2564008" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/model/ae/decoder/deconv3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model/ae/decoder/deconv3/Conv_output_0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/model/ae/decoder/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
